{
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "hidden_dim": 3072,
  "id2label": {
    "0": "Payment and Finance",
    "1": "Site",
    "2": "Design and Scope",
    "3": "Delay and Time",
    "4": "Quality",
    "5": "Contract"
  },
  "initializer_range": 0.02,
  "label2id": {
    "Contract": 5,
    "Delay and Time": 3,
    "Design and Scope": 2,
    "Payment and Finance": 0,
    "Quality": 4,
    "Site": 1
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "torch_dtype": "float32",
  "transformers_version": "4.55.0",
  "vocab_size": 30522
}
